In [28]:
from mimiciii_db import DB
from mimiciii_db.config import db_url

In [30]:
conn = DB.from_url(db_url())
conn.query_df(
    'SELECT * FROM mimiciii.patients LIMIT 100'
)

,row_id,subject_id,gender,dob,dod,dod_hosp,dod_ssn,expire_flag
0,234,249,F,2075-03-13,NaT,NaT,NaT,0
1,235,250,F,2164-12-27,2188-11-22,2188-11-22,NaT,1
2,236,251,M,2090-03-15,NaT,NaT,NaT,0
3,237,252,M,2078-03-06,NaT,NaT,NaT,0
4,238,253,F,2089-11-26,NaT,NaT,NaT,0
...,...,...,...,...,...,...,...,...
95,701,744,M,2024-05-24,NaT,NaT,NaT,0
96,702,745,M,2142-06-14,2204-03-03,NaT,2204-03-03,1
97,703,746,M,2085-06-02,NaT,NaT,NaT,0
98,704,747,M,2063-03-10,2147-03-07,2147-03-07,2147-03-07,1
99,705,748,M,2081-07-13,NaT,NaT,NaT,0